:PROPERTIES:
:ID:       61678BF7-A363-45C2-A3E2-54A1EB15EF68
:header-args: :results output
:END:
#+title: brew

Homebrew is a package manager for [[id:516B3C9A-4288-4ACF-8DEE-3526DFD21083][macOS]].

At one point it seemed like brew and MacPorts were competing, but it
feels like at this point brew won out for the macOS specific title.

I use brew for many host specific installations...for anything that
may be project specific I'd probably go with nix.

#+begin_src shell
  brew --version
#+end_src

#+RESULTS:
: Homebrew 6.0.2

* Help

#+begin_src shell :results output
  brew --help
#+end_src

#+RESULTS:
#+begin_example
Example usage:
  brew search TEXT|/REGEX/
  brew info [FORMULA|CASK...]
  brew install FORMULA|CASK...
  brew update
  brew upgrade [FORMULA|CASK...]
  brew uninstall FORMULA|CASK...
  brew list [FORMULA|CASK...]

Troubleshooting:
  brew config
  brew doctor
  brew install --verbose --debug FORMULA|CASK

Contributing:
  brew create URL [--no-fetch]
  brew edit [FORMULA|CASK...]

Further help:
  brew commands
  brew help [COMMAND]
  man brew
  https://docs.brew.sh
#+end_example

* Info

** Help

#+begin_src shell :results output
  brew info --help
#+end_src

#+RESULTS:
#+begin_example
Usage: brew info, abv [options] [formula|cask ...]

Display brief statistics for your Homebrew installation. If a formula or
cask is provided, show summary of information about it.

      --analytics                  List global Homebrew analytics data or, if
                                   specified, installation and build error data
                                   for formula (provided neither
                                   $HOMEBREW_NO_ANALYTICS nor
                                   $HOMEBREW_NO_GITHUB_API are set).
      --days                       How many days of analytics data to retrieve.
                                   The value for days must be 30, 90 or
                                   365. The default is 30.
      --category                   Which type of analytics data to retrieve. The
                                   value for category must be install,
                                   install-on-request or build-error;
                                   cask-install or os-version may be
                                   specified if formula is not. The default is
                                   install.
      --github                     Open the GitHub source page for formula and
                                   cask in a browser. To view the history
                                   locally: brew log -p formula or cask
      --json                       Print a JSON representation. Currently the
                                   default value for version is v1 for
                                   formula. For formula and cask use v2.
                                   See the docs for examples of using the JSON
                                   output: https://docs.brew.sh/Querying-Brew
      --installed                  Output a human-readable inventory of
                                   installed formulae and casks. If --json is
                                   passed, print JSON for installed formulae
                                   and, with --json=v2, installed casks.
      --variations                 Include the variations hash in each formula's
                                   JSON output.
  -v, --verbose                    Show more verbose data for formula, or full
                                   information with --installed.
      --formula, --formulae        Treat all named arguments as formulae.
      --cask, --casks              Treat all named arguments as casks.
      --sizes                      Show the size of installed formulae and
                                   casks.
  -d, --debug                      Display any debugging information.
  -q, --quiet                      Make some output more quiet.
  -h, --help                       Show this message.
#+end_example

* Install
:PROPERTIES:
:ID:       09B4F4F5-8C42-4112-88A8-54A69E404549
:ROAM_ALIASES: brew-install
:END:

#+begin_src shell :results output
  brew install --help
#+end_src

#+RESULTS:
#+begin_example
Usage: brew install [options] formula|cask [...]

Install a formula or cask. Additional options specific to a formula may be
appended to the command.

Unless $HOMEBREW_NO_INSTALLED_DEPENDENTS_CHECK is set, brew upgrade or brew
reinstall will be run for outdated dependents and dependents with broken
linkage, respectively.

Unless $HOMEBREW_NO_INSTALL_CLEANUP is set, brew cleanup will then be run
for the installed formulae or, every 30 days, for all formulae.

Unless $HOMEBREW_NO_INSTALL_UPGRADE is set, brew install formula will
upgrade formula if it is already installed but outdated.

  -d, --debug                      If brewing fails, open an interactive
                                   debugging session with access to IRB or a
                                   shell inside the temporary build directory.
      --display-times              Print install times for each package at the
                                   end of the run. Enabled by default if
                                   $HOMEBREW_DISPLAY_INSTALL_TIMES is set.
  -f, --force                      Install formulae without checking for
                                   previously installed keg-only or non-migrated
                                   versions. When installing casks, overwrite
                                   existing files (binaries and symlinks are
                                   excluded, unless originally from the same
                                   cask).
  -v, --verbose                    Print the verification and post-install
                                   steps.
  -n, --dry-run                    Show what would be installed, but do not
                                   actually install anything.
  -y, --no-ask, --yes              Do not ask for confirmation before
                                   downloading and installing. Ask mode is the
                                   default. Enabled by default if
                                   $HOMEBREW_NO_ASK is set.
      --formula, --formulae        Treat all named arguments as formulae.
      --ignore-dependencies        An unsupported Homebrew development option to
                                   skip installing any dependencies of any kind.
                                   If the dependencies are not already present,
                                   the formula will have issues. If you're not
                                   developing Homebrew, consider adjusting your
                                   PATH rather than using this option.
      --only-dependencies          Install the dependencies with specified
                                   options but do not install the formula
                                   itself.
      --cc                         Attempt to compile using the specified
                                   compiler, which should be the name of the
                                   compiler's executable, e.g. gcc-9 for GCC
                                   9. In order to use LLVM's clang, specify
                                   llvm_clang. To use the Apple-provided
                                   clang, specify clang. This option will only
                                   accept compilers that are provided by
                                   Homebrew or bundled with macOS. Please do not
                                   file issues if you encounter errors while
                                   using this option.
  -s, --build-from-source          Compile formula from source even if a
                                   bottle is provided. Dependencies will still
                                   be installed from bottles if they are
                                   available.
      --force-bottle               Install from a bottle if it exists for the
                                   current or newest version of macOS, even if
                                   it would not normally be used for
                                   installation.
      --include-test               Install testing dependencies required to run
                                   brew test formula.
      --HEAD                       If formula defines it, install the HEAD
                                   version, aka. main, trunk, unstable, master.
      --fetch-HEAD                 Fetch the upstream repository to detect if
                                   the HEAD installation of the formula is
                                   outdated. Otherwise, the repository's HEAD
                                   will only be checked for updates when a new
                                   stable or development version has been
                                   released.
      --keep-tmp                   Retain the temporary files created during
                                   installation.
      --debug-symbols              Generate debug symbols on build. Source will
                                   be retained in a cache directory.
      --build-bottle               Prepare the formula for eventual bottling
                                   during installation, skipping any
                                   post-install steps.
      --skip-post-install          Install but skip any post-install steps.
      --skip-link                  Install but skip linking the keg into the
                                   prefix.
      --as-dependency              Install but mark as installed as a dependency
                                   and not installed on request.
      --bottle-arch                Optimise bottles for the specified
                                   architecture rather than the oldest
                                   architecture supported by the version of
                                   macOS the bottles are built on.
  -i, --interactive                Download and patch formula, then open a
                                   shell. This allows the user to run
                                   ./configure --help and otherwise determine
                                   how to turn the software package into a
                                   Homebrew package.
  -g, --git                        Create a Git repository, useful for creating
                                   patches to the software.
      --overwrite                  Delete files that already exist in the prefix
                                   while linking.
      --cask, --casks              Treat all named arguments as casks.
      --[no-]binaries              Disable/enable linking of helper executables
                                   (default: enabled).
      --require-sha                Require all casks to have a checksum.
      --adopt                      Adopt existing artifacts in the destination
                                   that are identical to those being installed.
                                   Cannot be combined with --force.
      --skip-cask-deps             Skip installing cask dependencies.
      --zap                        For use with brew reinstall --cask. Remove
                                   all files associated with a cask. May remove
                                   files which are shared between applications.
      --appdir                     Target location for Applications (default:
                                   /Applications).
      --appimagedir                Target location for AppImages (default:
                                   ~/Applications).
      --keyboard-layoutdir         Target location for Keyboard Layouts
                                   (default: /Library/Keyboard Layouts).
      --colorpickerdir             Target location for Color Pickers (default:
                                   ~/Library/ColorPickers).
      --prefpanedir                Target location for Preference Panes
                                   (default: ~/Library/PreferencePanes).
      --qlplugindir                Target location for Quick Look Plugins
                                   (default: ~/Library/QuickLook).
      --mdimporterdir              Target location for Spotlight Plugins
                                   (default: ~/Library/Spotlight).
      --dictionarydir              Target location for Dictionaries (default:
                                   ~/Library/Dictionaries).
      --fontdir                    Target location for Fonts (default:
                                   ~/Library/Fonts).
      --servicedir                 Target location for Services (default:
                                   ~/Library/Services).
      --input-methoddir            Target location for Input Methods (default:
                                   ~/Library/Input Methods).
      --internet-plugindir         Target location for Internet Plugins
                                   (default: ~/Library/Internet Plug-Ins).
      --audio-unit-plugindir       Target location for Audio Unit Plugins
                                   (default:
                                   ~/Library/Audio/Plug-Ins/Components).
      --vst-plugindir              Target location for VST Plugins (default:
                                   ~/Library/Audio/Plug-Ins/VST).
      --vst3-plugindir             Target location for VST3 Plugins (default:
                                   ~/Library/Audio/Plug-Ins/VST3).
      --screen-saverdir            Target location for Screen Savers (default:
                                   ~/Library/Screen Savers).
      --language                   Comma-separated list of language codes to
                                   prefer for cask installation. The first
                                   matching language is used, otherwise it
                                   reverts to the cask's default language. The
                                   default value is the language of your system.
  -q, --quiet                      Make some output more quiet.
  -h, --help                       Show this message.
#+end_example

* List

** Help

#+begin_src shell
  brew list --help
#+end_src

#+RESULTS:
#+begin_example
Usage: brew list, ls [options] [installed_formula|installed_cask ...]

List all installed formulae and casks. If formula is provided, summarise the
paths within its current keg. If cask is provided, list its artifacts.

      --formula, --formulae        List only formulae, or treat all named
                                   arguments as formulae.
      --cask, --casks              List only casks, or treat all named arguments
                                   as casks.
      --full-name                  Print formulae with fully-qualified names.
                                   Unless --full-name, --versions or
                                   --pinned are passed, other options (i.e.
                                   -1, -l, -r and -t) are passed to
                                   ls(1) which produces the actual output.
      --versions                   Show the version number for installed
                                   formulae, or only the specified formulae if
                                   formula are provided.
      --json                       Output installed formulae and casks with
                                   versions, linked and opt-linked formula
                                   versions and pinned versions as JSON using
                                   the fast Bash command path. Requires
                                   --versions, no named arguments and jq.
      --multiple                   Only show formulae with multiple versions
                                   installed. Implies --versions.
      --pinned                     List only pinned packages, or only the
                                   specified (pinned) packages if formula or
                                   cask are provided. See also pin, unpin.
      --installed-on-request       List the formulae installed on request.
      --no-installed-on-request    List the formulae not installed on request
                                   (i.e. installed as dependencies).
      --poured-from-bottle         List the formulae installed from a bottle.
      --built-from-source          List the formulae compiled from source.
  -1                               Force output to be one entry per line. This
                                   is the default when output is not to a
                                   terminal.
  -l                               List formulae and/or casks in long format.
                                   Has no effect when a formula or cask name is
                                   passed as an argument.
  -r                               Reverse the order of formula and/or cask
                                   sorting to list the oldest entries first. Has
                                   no effect when a formula or cask name is
                                   passed as an argument.
  -t                               Sort formulae and/or casks by time modified,
                                   listing most recently modified first. Has no
                                   effect when a formula or cask name is passed
                                   as an argument.
  -d, --debug                      Display any debugging information.
  -q, --quiet                      Make some output more quiet.
  -v, --verbose                    Make some output more verbose.
  -h, --help                       Show this message.
#+end_example

** Example

#+begin_src shell
  brew list
#+end_src

#+RESULTS:
#+begin_example
acli
aften
aom
apache-serf
apr
apr-util
at-spi2-core
atk
autoconf
bdw-gc
berkeley-db@5
bison
block-goose-cli
boost
botan
brotli
ca-certificates
cairo
cd-discid
certifi
chezscheme
cmake
colima
coreutils
dafny
dav1d
dbus
deno
docbook
docbook-xsl
docker
dotnet@8
double-conversion
extra-cmake-modules
ffmpeg
flac
fluid-synth
fontconfig
freetype
fribidi
gcc
gd
gdk-pixbuf
gettext
gh
ghostscript
giflib
glib
glibmm
gmp
gnupg
gnutls
go
gpgme
graphite2
graphviz
gsettings-desktop-schemas
gtk+
gtk+3
gts
guile
harfbuzz
hicolor-icon-theme
highway
hledger
icu4c@78
idris2
imath
isl
iso-codes
jack
jasper
jbig2dec
jpeg-turbo
jpeg-xl
karchive
kdoctools
kf5-attica
kf5-breeze-icons
kf5-kactivities
kf5-kauth
kf5-kcodecs
kf5-kcompletion
kf5-kconfig
kf5-kconfigwidgets
kf5-kcoreaddons
kf5-kcrash
kf5-kdbusaddons
kf5-kglobalaccel
kf5-kguiaddons
kf5-kiconthemes
kf5-kirigami2
kf5-kitemmodels
kf5-kitemviews
kf5-kjobwidgets
kf5-knotifications
kf5-kpackage
kf5-kpty
kf5-kservice
kf5-kwallet
kf5-kwidgetsaddons
kf5-kwindowsystem
kf5-syntax-highlighting
ki18n
lame
leptonica
libao
libarchive
libass
libassuan
libavif
libb2
libcdio
libcdio-paranoia
libdatrie
libdeflate
libepoxy
libgcrypt
libgpg-error
libidn
libidn2
libksba
liblinear
libmpc
libogg
libpng
librsvg
libsamplerate
libsigc++
libsndfile
libssh2
libtasn1
libthai
libtiff
libtool
libunibreak
libunistring
libusb
libvmaf
libvorbis
libvpx
libx11
libxau
libxcb
libxdmcp
libxext
libxfixes
libxi
libxml2
libxrender
libxslt
libxtst
lilypond
lima
little-cms2
lua
lz4
lzo
m4
md4c
mpdecimal
mpfr
mpg123
nano
ncurses
netcat
netpbm
nettle
nmap
npth
nspr
nss
openexr
openjdk
openjdk@21
openjpeg
openjph
openssl@3
opus
p11-kit
pango
pcre2
phonon
pinentry
pixman
pkcs11-helper
pkg-config
pkgconf
plantuml
portaudio
python@3.11
python@3.12
python@3.14
qca
qt5compat
qt@5
qtbase
qtdeclarative
qtshadertools
qtsvg
readline
sdl2
shared-mime-info
speex
sqlite
subversion
svt-av1
telnet
tesseract
threadweaver
timidity
tree
utf8proc
webp
x264
x265
xorgproto
xz
yt-dlp
z3
zstd
audacity
emacs
emacs-app
inkscape
vlc
#+end_example

** List Package files

#+begin_src shell
  brew list libcdio-paranoia
#+end_src

#+RESULTS:
#+begin_example
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/INSTALL_RECEIPT.json
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/bin/cd-paranoia
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/.brew/libcdio-paranoia.rb
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/ChangeLog
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/AUTHORS
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/NEWS.md
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/include/cdio/paranoia/toc.h
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/include/cdio/paranoia/cdda.h
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/include/cdio/paranoia/paranoia.h
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/sbom.spdx.json
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/README
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/README.md
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/COPYING
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/lib/pkgconfig/libcdio_paranoia.pc
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/lib/pkgconfig/libcdio_cdda.pc
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/lib/libcdio_paranoia.2.dylib
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/lib/libcdio_cdda.2.dylib
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/lib/libcdio_paranoia.dylib
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/lib/libcdio_paranoia.a
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/lib/libcdio_cdda.dylib
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/lib/libcdio_cdda.a
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/share/man/ja/man1/cd-paranoia.1
/opt/homebrew/Cellar/libcdio-paranoia/10.2-2.0.2/share/man/man1/cd-paranoia.1
#+end_example
* brew-search
:PROPERTIES:
:ID:       0F384B87-44DD-4D61-8590-02F79024BB99
:END:

#+begin_src shell
  brew search --help
#+end_src

#+RESULTS:
#+begin_example
Usage: brew search, -S [options] text|/regex/ [...]

Perform a substring search of cask tokens and formula names for text. If
text is flanked by slashes, it is interpreted as a regular expression.

      --formula, --formulae        Search for formulae.
      --cask, --casks              Search for casks.
      --desc                       Search for formulae with a description
                                   matching text and casks with a name or
                                   description matching text.
      --pull-request               Search for GitHub pull requests containing
                                   text.
      --open                       Search for only open GitHub pull requests.
      --closed                     Search for only closed GitHub pull requests.
      --alpine                     Search for text in the given database.
      --repology                   Search for text in the given database.
      --macports                   Search for text in the given database.
      --fink                       Search for text in the given database.
      --opensuse                   Search for text in the given database.
      --fedora                     Search for text in the given database.
      --archlinux                  Search for text in the given database.
      --debian                     Search for text in the given database.
      --ubuntu                     Search for text in the given database.
  -d, --debug                      Display any debugging information.
  -q, --quiet                      Make some output more quiet.
  -v, --verbose                    Make some output more verbose.
  -h, --help                       Show this message.
#+end_example
